app/controllers/users_controller.rb

    def create
        @user = User.new(fine_user)
        #@user = User.new(username: params[:username], email: params[:email], password: params[:password])

        if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "sadsa"], ["email", "dsadas@a.com"], ["password", "asadas"], ["created_at", "2019-01-23 15:17:04.499604"], ["updated_at", "2019-01-23 15:17:04.499604"]]

      def update
        @user = User.find(params[:id])
        if @user.update(fine_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "we_changed"], ["password", "asdas"], ["updated_at", "2019-01-23 15:30:20.324384"], ["id", 1]]